/*Этот код запускает тесты. Рабочий блок раскомент. а нерабочий коментируем.
/////////////////////////////////////////////////////////////////////
        ЭТО БЛОК ДЛЯ ВАЛИДНЫХ И НЕВАЛИДНЫХ ТЕСТОВ МЕТОДОМ GET

Импортируем массив данных для тестов*/
// import { tests } from "./DataGetTest";
//  //Импортируем функцию для запуска тестов
// import { testing } from "./FanGetTest";

/*/////////////////////////////////////////////////////////////////////
        ЭТО БЛОК ДЛЯ РАБОТЫ С HEADERS

Импортируем массив данных для тестов */
// import {arrreyHeaders, testing,  tests } from "../Headers/DataHeaderTest";

/*/////////////////////////////////////////////////////////////////////
        ЭТО БЛОК ДЛЯ РАБОТЫ С BODY

Импортируем массив данных для тестов */
import { bodyData, testing,  tests  } from "../Body/DataBodyTest";

/////////////////////////////////////////////////////////////////////

// Запускаем тест
describe("Тесты https://weatherstack.com/", () => {
  //for (let test of tests) {
  testing(tests);
  //}
});
